app/views/search/products.html.erb

            <dt>最安値</dt>
            <dd><%= humanized_money_with_symbol product.providers.first.price.exchange_to(@currency_code)%></dd>
---
SELECT `providers`.* FROM `providers` WHERE `providers`.`product_id` IN (34, 33, 32, 31, 23, 22, 20, 18, 17, 16) ORDER BY price DESC