app/controllers/api_controller.rb

SELECT `product_types`.* FROM `product_types` WHERE (category_id = 1)
---
  def get_type_from_category
#    raise unless request.xhr?
    category_id = params["category_id"].to_i
    types = ProductType.where(["category_id = ?", category_id])