app/controllers/products_controller.rb

SELECT `shops`.* FROM `shops` WHERE `shops`.`id` = 7 LIMIT 1
---
  def show
    @product = Product.where(["id = ?", params[:id].to_i]).first
    raise NoProductError if @product.blank?

    @shop = Shop.where(["id = ?", @product.shop_id]).first