app/controllers/products_controller.rb

SELECT `products`.* FROM `products`
---
  def index
    @products = Product.all

SELECT `products`.* FROM `products` WHERE (id = 32) ORDER BY products.updated_at DESC LIMIT 1
SELECT `shops`.* FROM `shops` WHERE (id = 3) LIMIT 1
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 32 ORDER BY id DESC LIMIT 1
SELECT `review_images`.* FROM `review_images` WHERE `review_images`.`product_id` = 32 ORDER BY id DESC LIMIT 1
SELECT `countries`.* FROM `countries`
---
  def show
    @product = Product.where(["id = ?", params[:id].to_i]).first
    raise NoProductError if @product.blank?

    @providers = @product.providers
    @product_contents = @product.contents

    @shop = @product.shop
    raise NoShopError if @shop.blank?

    @reviews = @product.reviews
    @review_images = @product.review_images

    @main_review = @reviews.first
    @main_image  = @review_images.first
    @countries = Country.all

SELECT `product_types`.* FROM `product_types`
SELECT `flavors`.* FROM `flavors`
SELECT `countries`.* FROM `countries`
---
  def new
    @shop_id = params[:shop_id]
    raise "お探しのお店が見つかりません" unless @shop_id.present?
    @product = Product.new
    @provider = Provider.new
    @product_types = ProductType.all
    @flavors = Flavor.all
    @countries = Country.all

SELECT `products`.* FROM `products` WHERE `products`.`id` = 6 LIMIT 1
---
  def edit
    @product = Product.find(params[:id])

SELECT `shops`.* FROM `shops` WHERE (id = '8') LIMIT 1
INSERT INTO `products` (`country_id`, `created_at`, `currency_id`, `name`, `price`, `shop_id`, `updated_at`, `url`) VALUES (1, '2013-03-19 14:44:15', 1, 'マカロン', 198, NULL, '2013-03-19 14:44:15', 'http://www')
INSERT INTO `providers` (`country_id`, `created_at`, `currency_id`, `name`, `on_sale_flg`, `price`, `product_id`, `updated_at`, `url`) VALUES (1, '2013-05-12 00:57:24', 1, 'ルタオ２', NULL, 100, 35, '2013-05-12 00:57:24', 'http://www.yahoo.co.jp')
INSERT INTO `product_contents` (`category_id`, `created_at`, `flavor_id`, `name`, `product_id`, `quantity`, `type_id`, `updated_at`) VALUES (2, '2013-05-12 00:57:24', 15, NULL, 35, 1, 8, '2013-05-12 00:57:24')
---
  def create
    product = Product.new(params[:product])
    if params[:product].present? && params[:product][:shop_id].present? && shop = Shop.where(["id = ?", params[:product][:shop_id]])
      shop_name = shop.first.name
    end
    content_params = params[:product_content]
    flavors     = params[:product_flavor]
    saved_flg   = false

    Product.transaction do
      product.save!
      provider = Provider.new((params[:provider]).merge({:name => shop_name, :product_id => product.id}))
      provider.save!
      flavors.each do |flavor_id, quantity|
        if quantity.to_i != 0
          product_content = ProductContent.new(content_params.merge(:product_id => product.id, :flavor_id => flavor_id, :quantity => quantity))
          product_content.save!