app/controllers/providers_controller.rb

  def show
    @provider = Provider.find(params[:id])
---
SELECT `providers`.* FROM `providers` WHERE `providers`.`id` = 1 LIMIT 1