app/controllers/reviews_controller.rb

  def create
    raise '画像を選択してください' if params[:review_image].blank?
    review = Review.new(params[:review])
    review_content = review.build_review_content({:comment => params[:comment]})

    unless params[:review_image].nil?
      review_image = ReviewImage.create(:review_image => params[:review_image])
    end

    Shop.transaction do
      review.save!
      review_content.save!
      review_image.user_id = @user.id
      review_image.product_id = review.product_id
      review_image.review_id = review.id
      review_image.save!
---
INSERT INTO `review_images` (`commment`, `created_at`, `product_id`, `review_id`, `review_image_name`, `review_image_uid`, `updated_at`, `user_id`) VALUES (NULL, '2013-03-19 16:21:01', NULL, NULL, '12.10.24 rutao cake.jpg', '2013/03/20/01_21_01_663_12.10.24_rutao_cake.jpg', '2013-03-19 16:21:01', NULL)
INSERT INTO `reviews` (`created_at`, `language_id`, `product_id`, `score`, `subject`, `updated_at`, `user_id`) VALUES ('2013-05-12 00:58:42', 1, 35, 2.5, 'aaaaaaaaaaaaaaaaaaaaaaa', '2013-05-12 00:58:42', 2)
INSERT INTO `review_contents` (`comment`, `created_at`, `review_id`, `updated_at`) VALUES ('ｄｄｄｄｄｄｄｄｄｄｄ', '2013-03-19 14:54:35', 1, '2013-03-19 14:54:35')
UPDATE `review_images` SET `user_id` = 1, `product_id` = 5, `review_id` = 8, `updated_at` = '2013-03-19 16:28:00' WHERE `review_images`.`id` = 7