app/controllers/search_controller.rb

SELECT COUNT(DISTINCT `products`.`id`) FROM `products` LEFT OUTER JOIN `product_contents` ON `product_contents`.`product_id` = `products`.`id` LEFT OUTER JOIN `providers` ON `providers`.`product_id` = `products`.`id` WHERE `products`.`id` IN (33, 32, 20) AND (product_contents.category_id = '1')
SELECT `products`.* FROM `products` ORDER BY products.updated_at DESC
SELECT `providers`.* FROM `providers` WHERE `providers`.`product_id` IN (34, 33, 32, 31, 23, 22, 20, 18, 17, 16, 14, 13, 12, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1) ORDER BY price DESC
SELECT `shops`.* FROM `shops` WHERE `shops`.`id` = 8 LIMIT 1
SELECT `product_contents`.* FROM `product_contents` WHERE `product_contents`.`product_id` IN (34, 33, 32, 31, 23, 22, 20, 18, 17, 16, 14, 13, 12, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1)
SELECT `flavors`.* FROM `flavors` WHERE `flavors`.`id` IN (1, 2, 3, 4, 6)
SELECT COUNT(DISTINCT `products`.`id`) FROM `products` LEFT OUTER JOIN `product_contents` ON `product_contents`.`product_id` = `products`.`id` LEFT OUTER JOIN `providers` ON `providers`.`product_id` = `products`.`id` WHERE (product_contents.category_id = '1') AND (product_contents.type_id = '10')
SELECT DISTINCT `products`.id FROM `products` LEFT OUTER JOIN `product_contents` ON `product_contents`.`product_id` = `products`.`id` LEFT OUTER JOIN `providers` ON `providers`.`product_id` = `products`.`id` WHERE (product_contents.category_id = '1') AND (product_contents.type_id = '10') ORDER BY products.updated_at DESC LIMIT 10 OFFSET 0
SELECT `product_categories`.* FROM `product_categories`
SELECT `product_types`.* FROM `product_types`
SELECT `product_categories`.* FROM `product_categories` WHERE `product_categories`.`id` = 1 LIMIT 1
SELECT `product_types`.* FROM `product_types` WHERE `product_types`.`id` IN (6, 4, 12, 8)
---
  def products
    if params[:order].present?
      if params[:order] == "score"
        order = "score DESC"
      elsif params[:order] == "updated"
        order = "id DESC"
      end
    end

    products = Product.includes(["contents", "providers"]).find_published
    if params[:search_shop].present?
      @shop = Shop.where(["name like ?", params[:search_shop].to_s + "%"])
      products = products.where(["shop_id in (?)", @shop.map{|s| s.try(&:id)}])
    end
    products = products.where(["product_contents.category_id = ?", params[:category_id]]) if params[:category_id].present?
    products = products.where(["product_contents.type_id = ?", params[:type_id]]) if params[:type_id].present?
    products = products.where(["product_contents.flavor_id = ?", params[:flavor_id]]) if params[:flavor_id].present?
    products = products.order(order) if order.present?
    @products = products.page(params[:page]).per(10)

    @categories = ProductCategory.all
    @types = ProductType.all
    @flavors = products.map(&:contents).flatten.map(&:flavor).uniq

    # 検索結果表示部
    @category_name = ProductCategory.find_by_id(params[:category_id].to_i).try(&:name)
    @type_name = ProductType.find_by_id(params[:type_id].to_i).try(&:name)