app/controllers/shops_controller.rb

  def index
    @shops = Shop.all
---
SELECT `shops`.* FROM `shops`

  def show
    @shop = Shop.find(params[:id])
    @shop_products = @shop.product
    @shop_reviews = @shop.shop_review
    @shop_main_review = @shop_reviews.first
    @shop_images = @shop.review_images
    @shop_main_image = @shop.images.first
---
SELECT `shops`.* FROM `shops` WHERE `shops`.`id` = 8 LIMIT 1
SELECT `shop_reviews`.* FROM `shop_reviews` WHERE `shop_reviews`.`shop_id` = 8 ORDER BY id DESC LIMIT 1
SELECT `products`.* FROM `products` WHERE `products`.`shop_id` = 8 ORDER BY products.updated_at DESC
SELECT `shop_images`.* FROM `shop_images` WHERE `shop_images`.`shop_id` = 9 ORDER BY id DESC LIMIT 1
SELECT `shop_review_images`.* FROM `shop_review_images` WHERE `shop_review_images`.`shop_id` = 8 ORDER BY id DESC LIMIT 1

  def edit
    @shop = Shop.find(params[:id])
---
SELECT `shops`.* FROM `shops` WHERE `shops`.`id` = 4 LIMIT 1

  def create
    @shop = Shop.new(params[:shop])

    respond_to do |format|
      if @shop.save
---
INSERT INTO `shops` (`address`, `country_id`, `created_at`, `home_url`, `latitude`, `longitude`, `name`, `online_url`, `score`, `state_id`, `updated_at`) VALUES ('aaaaaaaa', 3, '2013-03-17 11:05:43', 'http://www.sadaharuaoki.com/', NULL, NULL, 'sadaharu aoki', 'http://www.sadaharuaoki.co.jp/', NULL, 1, '2013-03-17 11:05:43')