app/controllers/shop_reviews_controller.rb

SELECT `shop_reviews`.* FROM `shop_reviews` WHERE `shop_reviews`.`id` = 3 LIMIT 1
---
  def show
    @shop_review = ShopReview.find(params[:id])

SELECT MAX(`shop_review_images`.`id`) AS max_id FROM `shop_review_images`
INSERT INTO `shop_reviews` (`comment`, `created_at`, `language_id`, `shop_id`, `subject`, `updated_at`, `user_id`) VALUES ('世界で一番おいしいマカロンが食べられます', '2013-03-17 11:10:23', NULL, 3, '日本の大使', '2013-03-17 11:10:23', NULL)
INSERT INTO `shop_review_images` (`comment`, `created_at`, `review_id`, `shop_id`, `shop_review_image_name`, `shop_review_image_uid`, `updated_at`, `user_id`) VALUES (NULL, '2013-03-17 16:50:30', NULL, NULL, '12.10.24 rutao cake.jpg', '2013/03/18/01_50_30_621_12.10.24_rutao_cake.jpg', '2013-03-17 16:50:30', NULL)
UPDATE `shop_review_images` SET `shop_id` = 6, `user_id` = 1, `review_id` = 48, `updated_at` = '2013-03-17 17:05:28' WHERE `shop_review_images`.`id` = 36
---
  def create
    raise '画像を選択してください' if params[:shop_review_image].blank?
    shop_review = ShopReview.new(params[:shop_review])
    Shop.transaction do
      shop_review.save!
      ShopReviewImage.save_from_image_file(params[:shop_review_image], shop_review)