app/views/products/_product_info_box.html.erb

SELECT `product_contents`.* FROM `product_contents` WHERE `product_contents`.`product_id` = 32
---
    <%- if i == 0-%>
      <th rowspan=<%= product_contents.length %>><%= ProductContent.model_name.human%></th>