app/views/products/_shop_info_box.html.erb

SELECT `states`.* FROM `states` WHERE `states`.`id` = 1 LIMIT 1
---
      <th>所在地</th>
      <td><%= shop.country.name %><%= shop.state.name %><br /><%= shop.address %></td>